export const SECTORS = [
  {
    id: 1,
    name: "قطاع خاص",
  },
  {
    id: 2,
    name: "قطاع حكومي",
  },
  {
    id: 3,
    name: "قطاع خيري",
  },
  {
    id: 4,
    name: "قطاع شبه حكومي",
  },
  {
    id: 5,
    name: "قطاع غير ربحي",
  },
];

export const REGIONS = [
  {
    id: 1,
    name: "منطقة الرياض",
  },
  {
    id: 2,
    name: "منطقة مكة المكرمة",
  },
  {
    id: 3,
    name: "منطقة المدينة المنورة",
  },
  {
    id: 4,
    name: "منطقة القصيم",
  },
  {
    id: 5,
    name: "المنطقة الشرقية",
  },
  {
    id: 6,
    name: "منطقة عسير",
  },
  {
    id: 7,
    name: "منطقة تبوك",
  },
  {
    id: 8,
    name: "منطقة حائل",
  },
  {
    id: 9,
    name: "منطقة الحدود الشمالية",
  },
  {
    id: 10,
    name: "منطقة جازان",
  },
  {
    id: 11,
    name: "منطقة نجران",
  },
  {
    id: 12,
    name: "منطقة الباحة",
  },
  {
    id: 13,
    name: "منطقة الجوف",
  },
];
