export const data = [
  {
    category: "استخدام الحاسب الالي",
    majors: [
      {
        id: "061101",
        title: "التطبيقات المكتبيةوصيانةالحاسب للمعوقين",
      },
      {
        id: "061102",
        title: "التطبيقات المكتبيةعلى الحاسب للمعوفين",
      },
    ],
  },
  {
    category: "تصميم وإدارة قواعد البيانات والشبكات",
    majors: [
      {
        id: "061201",
        title: "إدارة أنظمة الشبكات",
      },
      {
        id: "061202",
        title: "الدعم الفني",
      },
      {
        id: "061203",
        title: "أمن المعلومات",
      },
    ],
  },
  {
    category: " تطوير وتحليل البرمجيات والتطبيقات",
    majors: [
      {
        id: "061301",
        title: "البرمجة وعلوم الحاسب",
      },
      {
        id: "061302",
        title: "هندسة البرمجيات",
      },
      {
        id: "061303",
        title: "تقنية المعلومات",
      },
      {
        id: "061204",
        title: "نظم المعلومات",
      },
    ],
  },
  {
    category: "برامج أخرى في تقنية الاتصالات والمعلومات غير مصنفة في مكان آخر",
    majors: [
      {
        id: "061901",
        title: "الذكاء الاصطناعي",
      },
      {
        id: "061902",
        title: "علوم البيانات",
      },
    ],
  },
  {
    category:
      "البرامج والمؤهلات متعددة التخصصات تتضمن تقنية الاتصالات والمعلومات",
    majors: [
      {
        id: "068801",
        title: "المعلوماتية الصحية",
      },
    ],
  },
  {
    category: "الهندسة والمعالجات الكيميائية",
    majors: [
      {
        id: "071101",
        title: "الهندسة الكيميائية",
      },
      {
        id: "071102",
        title: "تقنية الهندسة الكيميائية",
      },
      {
        id: "071103",
        title: "هندسة المواد",
      },
      {
        id: "071104",
        title: "تقنية هندسة مواد",
      },
      {
        id: "071105",
        title: "الهندسة النووية",
      },
      {
        id: "071106",
        title: "تقنية الهندسة النووية",
      },
    ],
  },
  {
    category: "الهندسة والمعالجات الكيميائية",
    majors: [{ "الهندسة البيئية": "071201" }],
  },
  {
    category: "الكهرباء والطاقة",
    majors: [
      {
        id: "071301",
        title: "الهندسة الكهربائية",
      },
      {
        id: "071302",
        title: "هندسة الطاقة",
      },
      {
        id: "071303",
        title: "تقنية هندسة الطاقة",
      },
    ],
  },
  {
    category: "الإلكترونيات والأتمتة",
    majors: [
      {
        id: "071401",
        title: "هندسة الإلكترونيات",
      },
      {
        id: "071402",
        title: "تقنية هندسة الإلكترونيات والاتصالات",
      },
      {
        id: "071403",
        title: "هندسة نظم التحكم والقياس",
      },
      {
        id: "071404",
        title: "تقنية هندسة التحكم والأتمتة",
      },
      {
        id: "071405",
        title: "هندسة الحاسب الآلي",
      },
      {
        id: "071406",
        title: "تقنية هندسة الحاسب الآلي",
      },
      {
        id: "071407",
        title: "هندسة الشبكات",
      },
      {
        id: "071408",
        title: "تقنية هندسة الشبكات",
      },
    ],
  },
  {
    category: "الميكانيك والحرف المعدنية",
    majors: [
      {
        id: "071501",
        title: "الهندسة الميكانيكية",
      },
      {
        id: "071502",
        title: "تقنية الهندسة الميكانيكية",
      },
    ],
  },
  {
    category: "السيارات والسفن والطائرات",
    majors: [
      {
        id: "071601",
        title: "هندسة الطيران",
      },
      {
        id: "071602",
        title: "الهندسة البحرية",
      },
      {
        id: "071604",
        title: "المحركات والمركبات",
      },
      {
        id: "071605",
        title: "تقنية هندسة المركبات",
      },
    ],
  },
  {
    category: "السيارات والسفن والطائرات",
    majors: [
      {
        id: "071901",
        title: "الهندسة الطبية الحيوية",
      },
      {
        id: "071902",
        title: "تقنية هندسة الأجهزة الطبية",
      },
      {
        id: "071903",
        title: "الهندسة الصناعية والنظم",
      },
      {
        id: "071904",
        title: "تقنية الهندسة الصناعية",
      },
    ],
  },
  {
    category: "الصناعات الغذائية",
    majors: [
      {
        id: "072101",
        title: "هندسة التصنيع الغذائي",
      },
      {
        id: "072102",
        title: "التغذية وعلوم الأطعمة",
      },
    ],
  },
  {
    category: "المواد الزجاج، الورق، البلاستيك، الخشب",
    majors: [
      {
        id: "072201",
        title: "تقنية تصنيع البلاستك",
      },
      {
        id: "072202",
        title: "تقنية صناعة المطاط",
      },
      {
        id: "072203",
        title: "إنتاج الورق وتقنية التعبئة والتغليف",
      },
      {
        id: "072204",
        title: "تصنيع المنتجات الزجاجية",
      },
      {
        id: "072205",
        title: "تصنيع المنتجات الخزفية",
      },
      {
        id: "072206",
        title: "تصنيع حجر البناء",
      },
    ],
  },
  {
    category: "النسيج الملابس الأحذية الجلود",
    majors: [
      {
        id: "072301",
        title: "الملابس والنسيج",
      },
      {
        id: "072302",
        title: "صناعات جلدية ومكملات",
      },
    ],
  },
  {
    category: "المناجم والتنقيب",
    majors: [
      {
        id: "072401",
        title: "هندسة التعدين",
      },
      {
        id: "072402",
        title: "هندسة النفط والغاز الطبيعي",
      },
      {
        id: "072403",
        title: "تقنية هندسة النفط والغاز الطبيعي",
      },
    ],
  },
  {
    category:
      "البرامج والمؤهلات متعددة التخصصات تتضمن تقنية الاتصالات والمعلومات",
    majors: [
      {
        id: "073101",
        title: "هندسة وإدارة التشييد",
      },
      {
        id: "073102",
        title: "الهندسة المعمارية",
      },
      {
        id: "073103",
        title: "تقنية الهندسة المعمارية",
      },
      {
        id: "073104",
        title: "العمارة",
      },
      {
        id: "073105",
        title: "التخطيط الحضري والإقليمي",
      },
      {
        id: "073106",
        title: "هندسة المساحة",
      },
      {
        id: "073107",
        title: "تقنية هندسة المساحة",
      },
      {
        id: "073108",
        title: "المساحة البحرية",
      },
    ],
  },
];
