export const data = [
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "امانة منطقة المدينة المنورة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
    ],
  },
  {
    title: "صفوة المهيدب",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "مكتب التعليم شرق المدينة المنورة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "مصنع عجوة المدينة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "الشركة الوطنية للصناعات الوطنية الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    title: "مصنع ابن نمرة للبلاستيك",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
];

export const RegionData = [
  {
    id: 1,
    region: "منطقة المدينة المنورة",
    cities: [
      {
        id: 101,
        city: "المدينة المنورة",
      },
      {
        id: 102,
        city: "ينبع",
      },
      {
        id: 103,
        city: "العلا",
      },
      {
        id: 104,
        city: "بدر",
      },
      {
        id: 105,
        city: "الحناكية",
      },
      {
        id: 106,
        city: "وادي الفرع",
      },
      {
        id: 107,
        city: "خيبر",
      },
      {
        id: 108,
        city: "مهد الذهب",
      },
      {
        id: 109,
        city: "العيص",
      },
      {
        id: 110,
        city: "وادي الفرع",
      },
    ],
  },
  {
    id: 2,
    region: "منطقة مكة المكرمة",
    cities: [
      {
        id: 201,
        city: "مكة المكرمة",
      },
      {
        id: 202,
        city: "جدة",
      },
      {
        id: 203,
        city: "الطائف",
      },
      {
        id: 204,
        city: "أضم",
      },
      {
        id: 205,
        city: "الجموم",
      },
      {
        id: 206,
        city: "الخرمة",
      },
      {
        id: 207,
        city: "العرضيات",
      },
      {
        id: 208,
        city: "القنفذة",
      },
      {
        id: 209,
        city: "الكامل",
      },
      {
        id: 210,
        city: "الليث",
      },
      {
        id: 211,
        city: "المويه",
      },
      {
        id: 212,
        city: "بحرة",
      },
      {
        id: 213,
        city: "تربة",
      },
      {
        id: 214,
        city: "خليص",
      },
      {
        id: 215,
        city: "رابغ",
      },
      {
        id: 216,
        city: "رنية",
      },
      {
        id: 217,
        city: "ميسان",
      },
    ],
  },
];

export const PostDetailsData = [
  {
    title:'تدريب تعاوني - تطوير تطبيقات الويب',
    description:
      "نهدف من خلال هذا البرنامج ” التدريب التعاوني – COOP “ إلى تمكين مهارات الطالبات و للتعرف على بيئة العمل في الواقع والتدريب والتطوير من إمكانيات الطالبة لكسب الخبرة العملية من خلال الحصيلة الأكاديمية التي من خلالها يمكن انشاء بيئة أكثر تطور وتقدم. سيقوم المتدربون لدينا ببناء واجهات المستخدم بإستخدام مكتبة React.js و سيتعلمون كيفية التعامل مع المكونات و الخصائص و غير ذلك.",
    reward: "لا يوجد",
    gender: "الكل",
    publishDate: "17/03/2023",
    programType: "17/03/2023",
    startDate: "17/03/2023",
    endDate: "17/03/2023",
    region: "منطقة الرياض",
    city: "الرياض",
    subEndDate: "17/03/2023",
    majors: [
      {
        major: "نظم المعلومات",
      },
      {
        major: "علوم الحاسب",
      },
      {
        major: "هندسة البرمجيات",
      },
      {
        major: "تقنية المعلومات",
      },
    ],
  },
];
