export const data = [
  {
    id: 1,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 2,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 3,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 4,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 5,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 6,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 7,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 8,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 9,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 10,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 11,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 12,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 13,
    title: "شركة التقنيات  الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 14,
    title: "امانة منطقة المدينة المنورة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
    ],
  },
  {
    id: 15,
    title: "صفوة المهيدب",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 16,
    title: "مكتب التعليم شرق المدينة المنورة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 17,
    title: "مصنع عجوة المدينة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 18,
    title: "الشركة الوطنية للصناعات الوطنية الحديثة",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
  {
    id: 19,
    title: "مصنع ابن نمرة للبلاستيك",
    majors: [
      {
        id: "1",
        major: "نظم المعلومات",
      },
      {
        id: "2",
        major: "تقنية المعلومات",
      },
      {
        id: "3",
        major: "علوم الحاسب",
      },
      {
        id: "4",
        major: "هندسة البرمجيات",
      },
      {
        id: "5",
        major: "هندسة الحاسب",
      },
    ],
  },
];

export const RegionData = [
  {
    id: 1,
    region: "منطقة المدينة المنورة",
    cities: [
      {
        id: 101,
        city: "المدينة المنورة",
      },
      {
        id: 102,
        city: "ينبع",
      },
      {
        id: 103,
        city: "العلا",
      },
      {
        id: 104,
        city: "بدر",
      },
      {
        id: 105,
        city: "الحناكية",
      },
      {
        id: 106,
        city: "وادي الفرع",
      },
      {
        id: 107,
        city: "خيبر",
      },
      {
        id: 108,
        city: "مهد الذهب",
      },
      {
        id: 109,
        city: "العيص",
      },
      {
        id: 110,
        city: "وادي الفرع",
      },
    ],
  },
  {
    id: 2,
    region: "منطقة مكة المكرمة",
    cities: [
      {
        id: 201,
        city: "مكة المكرمة",
      },
      {
        id: 202,
        city: "جدة",
      },
      {
        id: 203,
        city: "الطائف",
      },
      {
        id: 204,
        city: "أضم",
      },
      {
        id: 205,
        city: "الجموم",
      },
      {
        id: 206,
        city: "الخرمة",
      },
      {
        id: 207,
        city: "العرضيات",
      },
      {
        id: 208,
        city: "القنفذة",
      },
      {
        id: 209,
        city: "الكامل",
      },
      {
        id: 210,
        city: "الليث",
      },
      {
        id: 211,
        city: "المويه",
      },
      {
        id: 212,
        city: "بحرة",
      },
      {
        id: 213,
        city: "تربة",
      },
      {
        id: 214,
        city: "خليص",
      },
      {
        id: 215,
        city: "رابغ",
      },
      {
        id: 216,
        city: "رنية",
      },
      {
        id: 217,
        city: "ميسان",
      },
    ],
  },
  {
    id: 3,
    region: "المنطقة الشرقية",
    cities: [
      {
        id: 301,
        city: "الدمام",
      },
      {
        id: 302,
        city: "الخبر",
      },
      {
        id: 303,
        city: "الجبيل",
      },
      {
        id: 304,
        city: "القطيف",
      },
      {
        id: 305,
        city: "حفر الباطن",
      },
      {
        id: 306,
        city: "النعيرية",
      },
      {
        id: 307,
        city: "العيون",
      },
      {
        id: 308,
        city: "رأس تنورة",
      },
      {
        id: 309,
        city: "الخفجي",
      },
      {
        id: 310,
        city: "العقير",
      },
      {
        id: 311,
        city: "الظهران",
      },
      {
        id: 312,
        city: "الأحساء",
      },
      {
        id: 313,
        city: "سيهات",
      },
      {
        id: 314,
        city: "الدرة",
      },
      {
        id: 315,
        city: "القرية العليا",
      },
      {
        id: 316,
        city: "بقيق",
      },
    ],
  },
  {
    id: 4,
    region: "منطقة الحدود الشمالية",
    cities: [
      {
        id: 401,
        city: "عرعر",
      },
      {
        id: 402,
        city: "طريف",
      },
      {
        id: 403,
        city: "رفحاء",
      },
      {
        id: 404,
        city: "العويقيلة",
      },
      {
        id: 405,
        city: "شعبة نصاب",
      },
    ],
  },
  {
    id: 5,
    region: "منطقة الرياض",
    cities: [
      {
        id: 501,
        city: "الرياض",
      },
      {
        id: 502,
        city: "الدرعية",
      },
      {
        id: 503,
        city: "الغرابي",
      },
      {
        id: 504,
        city: "الخرج",
      },
      {
        id: 505,
        city: "الزلفي",
      },
      {
        id: 506,
        city: "المجمعة",
      },
      {
        id: 507,
        city: "القويعية",
      },
      {
        id: 508,
        city: "العيينة",
      },
      {
        id: 509,
        city: "الدوادمي",
      },
      {
        id: 510,
        city: "المزاحمية",
      },
    ],
  },
  {
    id: 6,
    region: "منطقة الجوف",
    cities: [
      {
        id: 601,
        city: "دومة الجندل",
      },
      {
        id: 602,
        city: "سكاكا",
      },
      {
        id: 603,
        city: "القريات",
      },
      {
        id: 604,
        city: "طبرجل",
      },
    ],
  },
  {
    id: 7,
    region: "منطقة تبوك",
    cities: [
      {
        id: 701,
        city: "تيماء",
      },
      {
        id: 702,
        city: "ضباء",
      },
      {
        id: 703,
        city: "الوجه",
      },
      {
        id: 704,
        city: "حقل",
      },
      {
        id: 705,
        city: "أملج",
      },
      {
        id: 706,
        city: "البدع",
      },
    ],
  },
  {
    id: 8,
    region: "منطقة حائل",
    cities: [
      {
        id: 801,
        city: "حائل",
      },
      {
        id: 802,
        city: "بقعاء",
      },
      {
        id: 803,
        city: "الغزالة",
      },
      {
        id: 804,
        city: "الشنان",
      },
      {
        id: 805,
        city: "موقق",
      },
      {
        id: 806,
        city: "الحائط",
      },
      {
        id: 807,
        city: "السليمي",
      },
      {
        id: 808,
        city: "الشملي",
      },
      {
        id: 809,
        city: "سميراء",
      },
    ],
  },
  {
    id: 9,
    region: "منطقة القصيم",
    cities: [
      {
        id: 901,
        city: "بريدة",
      },
      {
        id: 902,
        city: "عنيزة",
      },
      {
        id: 903,
        city: "الرس",
      },
      {
        id: 904,
        city: "المذنب",
      },
      {
        id: 905,
        city: "البكيرية",
      },
      {
        id: 906,
        city: "البدائع",
      },
      {
        id: 907,
        city: "الأسياح",
      },
      {
        id: 908,
        city: "النبهانية",
      },
      {
        id: 909,
        city: "عيون الجواء",
      },
      {
        id: 910,
        city: "رياض الخبراء",
      },
      {
        id: 911,
        city: "الشماسية",
      },
      {
        id: 912,
        city: "عقلة الصقور",
      },
      {
        id: 913,
        city: "ضرية",
      },
    ],
  },
  {
    id: 10,
    region: "منطقة نجران",
    cities: [
      {
        id: 1001,
        city: "نجران",
      },
      {
        id: 1002,
        city: "شرورة",
      },
      {
        id: 1003,
        city: "حبونا",
      },
      {
        id: 1004,
        city: "ثار",
      },
      {
        id: 1005,
        city: "يدمه",
      },
      {
        id: 1006,
        city: "بدر الجنوب",
      },
      {
        id: 1007,
        city: "خباش",
      },
      {
        id: 1008,
        city: "الخرخير",
      },
    ],
  },
  {
    id: 11,
    region: "منطقة عسير",
    cities: [
      {
        id: 1101,
        city: "أبها",
      },
      {
        id: 1102,
        city: "خميش مشيط",
      },
      {
        id: 1103,
        city: "بيشة",
      },
      {
        id: 1104,
        city: "النماص",
      },
      {
        id: 1105,
        city: "أحد رفيدة",
      },
      {
        id: 1106,
        city: "بارق",
      },
      {
        id: 1107,
        city: "البرك",
      },
      {
        id: 1108,
        city: "بلقرن",
      },
      {
        id: 1109,
        city: "تثليث",
      },
      {
        id: 1110,
        city: "تنومة",
      },
      {
        id: 1111,
        city: "رجال ألمع",
      },
      {
        id: 1112,
        city: "الحرجة",
      },
      {
        id: 1113,
        city: "سراة عبيدة",
      },
      {
        id: 1114,
        city: "طريب",
      },
      {
        id: 1115,
        city: "الامواه",
      },
      {
        id: 1116,
        city: "ظهران الجنوب",
      },
      {
        id: 1117,
        city: "محايل عسير",
      },
      {
        id: 1118,
        city: "المجاردة",
      },
    ],
  },
  {
    id: 12,
    region: "منطقة الباحة",
    cities: [
      {
        id: 1201,
        city: "الباحة",
      },
      {
        id: 1202,
        city: "بلجرشي",
      },
      {
        id: 1203,
        city: "المندق",
      },
      {
        id: 1204,
        city: "المخواة",
      },
      {
        id: 1205,
        city: "العقيق",
      },
      {
        id: 1206,
        city: "قلوة",
      },
      {
        id: 1207,
        city: "القرى",
      },
      {
        id: 1208,
        city: "بني حسن",
      },
      {
        id: 1209,
        city: "غامد الزناد",
      },
      {
        id: 1210,
        city: "الحجرة",
      },
    ],
  },
  {
    id: 13,
    region: "منطقة جازان",
    cities: [
      {
        id: 1301,
        city: "صبيا",
      },
      {
        id: 1302,
        city: "صامطة",
      },
      {
        id: 1303,
        city: "أبو عريش",
      },
      {
        id: 1304,
        city: "جيزان",
      },
      {
        id: 1305,
        city: "أحد المسارحة",
      },
      {
        id: 1306,
        city: "بيش",
      },
      {
        id: 1307,
        city: "العارضة",
      },
      {
        id: 1308,
        city: "ضمد",
      },
      {
        id: 1309,
        city: "الدرب",
      },
      {
        id: 1310,
        city: "العيدابي",
      },
      {
        id: 1311,
        city: "الدائر",
      },
      {
        id: 1312,
        city: "الريث",
      },
      {
        id: 1313,
        city: "الحرث",
      },
      {
        id: 1314,
        city: "فرسان",
      },
      {
        id: 1315,
        city: "الطوال",
      },
      {
        id: 1316,
        city: "هروب",
      },
      {
        id: 1317,
        city: "فيفاء",
      },
    ],
  },
];

export const SECTORS = [
  {
    id: 1,
    name: "قطاع خاص",
  },
  {
    id: 2,
    name: "قطاع حكومي",
  },
  {
    id: 3,
    name: "قطاع خيري",
  },
  {
    id: 4,
    name: "قطاع شبه حكومي",
  },
  {
    id: 5,
    name: "قطاع غير ربحي",
  },
];

export const PostDetailsData = [
  {
    title: "تدريب تعاوني - تطوير تطبيقات الويب",
    description:
      "نهدف من خلال هذا البرنامج ” التدريب التعاوني – COOP “ إلى تمكين مهارات الطالبات و للتعرف على بيئة العمل في الواقع والتدريب والتطوير من إمكانيات الطالبة لكسب الخبرة العملية من خلال الحصيلة الأكاديمية التي من خلالها يمكن انشاء بيئة أكثر تطور وتقدم. سيقوم المتدربون لدينا ببناء واجهات المستخدم بإستخدام مكتبة React.js و سيتعلمون كيفية التعامل مع المكونات و الخصائص و غير ذلك.",
    reward: "لا يوجد",
    gender: "الكل",
    publishDate: "17/03/2023",
    programType: "17/03/2023",
    startDate: "17/03/2023",
    endDate: "17/03/2023",
    region: "منطقة الرياض",
    city: "الرياض",
    subEndDate: "17/03/2023",
    majors: [
      {
        major: "نظم المعلومات",
      },
      {
        major: "علوم الحاسب",
      },
      {
        major: "هندسة البرمجيات",
      },
      {
        major: "تقنية المعلومات",
      },
    ],
  },
];


export const TableDetailData = [
  {
    key: 1,
    name: "جامعة طيبة",
    institution: 34,
    student: 33,
  },
  {
    key: 2,
    name: "جامعة طيبة",
    institution: 34,
    student: 33,
  },
  {
    key: 3,
    name: "جامعة طيبة",
    institution: 34,
    student: 33,
  },
  {
    key: 1,
    name: "جامعة طيبة",
    institution: 34,
    student: 33,
  },
  {
    key: 2,
    name: "جامعة طيبة",
    institution: 34,
    student: 33,
  },
  {
    key: 3,
    name: "جامعة طيبة",
    institution: 34,
    student: 33,
  },
 
];